Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.grcs.jss-upload.AdobeReaderDC
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.AdobeReaderDC

Input:
  NAME: Adobe Reader DC
  CATEGORY: Adobe

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator
  
  -Processor: com.github.grahampugh.recipes.postprocessors/Slacker
    Arguments:
      webhook_url: https://hooks.slack.com/services/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
