Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.grcs.jss-upload.CitrixWorkspace
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.CitrixWorkspaces

Input:
  NAME: Citrix Workspace
  CATEGORY: Utilities

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
