Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.grcs.jss-upload.GoogleChrome
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.googlechrome

Input:
  NAME: Google Chrome
  CATEGORY: Browsers

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
