Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.grcs.jss-upload.GoogleChrome
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.googlechrome
runs-on: self-hosted

Input:
  NAME: Google Chrome
  CATEGORY: Browsers
  UPDATE_PREDICATE: "pkg_uploaded == True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator
